#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warnings:

- Deprecated Resource
  on modules/vertex-ai-workbench/main.tf line 49

To see the full warning notes, run Terraform without -compact-warnings.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.google_client_config.provider: Reading...
module.gcr.google_project_service.api["artifactregistry.googleapis.com"]: Refreshing state... [id=tbd-2024l-276747/artifactregistry.googleapis.com]
module.data-pipelines.google_storage_bucket.tbd-code-bucket: Refreshing state... [id=tbd-2024l-276747-code]
module.vpc.module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/tbd-2024l-276747/global/networks/main-vpc]
module.data-pipelines.google_storage_bucket.tbd-data-bucket: Refreshing state... [id=tbd-2024l-276747-data]
data.google_client_config.provider: Read complete after 0s [id=projects/"tbd-2024l-276747"/regions/"europe-west1"/zones/<null>]
module.vpc.module.cloud-router.google_compute_router.router: Refreshing state... [id=projects/tbd-2024l-276747/regions/europe-west1/routers/nat-router]
module.vpc.module.vpc.module.subnets.google_compute_subnetwork.subnetwork["europe-west1/subnet-01"]: Refreshing state... [id=projects/tbd-2024l-276747/regions/europe-west1/subnetworks/subnet-01]
google_compute_firewall.allow-all-internal: Refreshing state... [id=projects/tbd-2024l-276747/global/firewalls/allow-all-internal]
module.vpc.google_compute_firewall.default-internal-allow-all: Refreshing state... [id=projects/tbd-2024l-276747/global/firewalls/default-internal-allow-all]
module.vpc.google_compute_firewall.fw-allow-ingress-from-iap: Refreshing state... [id=projects/tbd-2024l-276747/global/firewalls/fw-allow-ingress-iap]
module.data-pipelines.google_storage_bucket_object.job-code["spark-job.py"]: Refreshing state... [id=tbd-2024l-276747-code-spark-job.py]
module.vpc.module.vpc.module.routes.google_compute_route.route["egress-internet"]: Refreshing state... [id=projects/tbd-2024l-276747/global/routes/egress-internet]
module.vpc.module.cloud-router.google_compute_router_nat.nats["nat-gateway"]: Refreshing state... [id=tbd-2024l-276747/europe-west1/nat-router/nat-gateway]
module.dataproc.google_project_service.dataproc: Refreshing state... [id=tbd-2024l-276747/dataproc.googleapis.com]
module.composer.google_project_service.api["composer.googleapis.com"]: Refreshing state... [id=tbd-2024l-276747/composer.googleapis.com]
module.composer.google_service_account.tbd-composer-sa: Refreshing state... [id=projects/tbd-2024l-276747/serviceAccounts/tbd-2024l-276747-data@tbd-2024l-276747.iam.gserviceaccount.com]
module.composer.google_compute_subnetwork.composer-subnet: Refreshing state... [id=projects/tbd-2024l-276747/regions/europe-west1/subnetworks/composer-subnet-01]
module.composer.google_project_iam_member.dataproc-editor-iam: Refreshing state... [id=tbd-2024l-276747/roles/dataproc.editor/serviceAccount:tbd-2024l-276747-data@tbd-2024l-276747.iam.gserviceaccount.com]
module.composer.google_project_iam_member.composer-member: Refreshing state... [id=tbd-2024l-276747/roles/composer.worker/serviceAccount:tbd-2024l-276747-data@tbd-2024l-276747.iam.gserviceaccount.com]
module.composer.google_project_iam_member.dataproc-sa-user-iam: Refreshing state... [id=tbd-2024l-276747/roles/iam.serviceAccountUser/serviceAccount:tbd-2024l-276747-data@tbd-2024l-276747.iam.gserviceaccount.com]
module.data-pipelines.google_storage_bucket_iam_member.tbd-data-bucket-iam-editor: Refreshing state... [id=b/tbd-2024l-276747-data/roles/storage.objectUser/serviceAccount:tbd-2024l-276747-data@tbd-2024l-276747.iam.gserviceaccount.com]
module.data-pipelines.google_storage_bucket_iam_member.tbd-code-bucket-iam-viewer: Refreshing state... [id=b/tbd-2024l-276747-code/roles/storage.objectViewer/serviceAccount:tbd-2024l-276747-data@tbd-2024l-276747.iam.gserviceaccount.com]
module.composer.module.composer.data.google_project.project: Reading...
module.gcr.google_artifact_registry_repository.registry: Refreshing state... [id=projects/tbd-2024l-276747/locations/europe/repositories/eu.gcr.io]
module.dataproc.google_dataproc_cluster.tbd-dataproc-cluster: Refreshing state... [id=projects/tbd-2024l-276747/regions/europe-west1/clusters/tbd-cluster]
module.composer.module.composer.data.google_project.project: Read complete after 0s [id=projects/tbd-2024l-276747]
module.composer.module.composer.google_project_iam_member.composer_agent_service_account[0]: Refreshing state... [id=tbd-2024l-276747/roles/composer.ServiceAgentV2Ext/serviceAccount:service-704118541832@cloudcomposer-accounts.iam.gserviceaccount.com]
module.jupyter_docker_image.docker_image.jupyter: Refreshing state... [id=sha256:6c13f563ad95714100ead4872a8d53d83e8c784991d89f35bc1a2caa5d57dbeceu.gcr.io/tbd-2024l-276747/jupyter:3.6.3]
module.jupyter_docker_image.docker_registry_image.jupyterlab: Refreshing state... [id=sha256:743a95cc2c7aa1ce7db6dd7a21e114efac824f6724a5e44125fc894359fd788f]
module.composer.module.composer.google_composer_environment.composer_env: Refreshing state... [id=projects/tbd-2024l-276747/locations/europe-west1/environments/demo-lab]
module.vertex_ai_workbench.google_project_service.notebooks: Refreshing state... [id=tbd-2024l-276747/notebooks.googleapis.com]
module.vertex_ai_workbench.google_project_iam_binding.token_creator_role: Refreshing state... [id=tbd-2024l-276747/roles/iam.serviceAccountTokenCreator]
module.vertex_ai_workbench.google_storage_bucket.notebook-conf-bucket: Refreshing state... [id=tbd-2024l-276747-conf]
module.vertex_ai_workbench.google_storage_bucket_iam_binding.binding: Refreshing state... [id=b/tbd-2024l-276747-conf/roles/storage.objectViewer]
module.vertex_ai_workbench.google_storage_bucket_object.post-startup: Refreshing state... [id=tbd-2024l-276747-conf-scripts/notebook_post_startup_script.sh]
module.data-pipelines.google_storage_bucket_object.dag-code["data-dag.py"]: Refreshing state... [id=europe-west1-demo-lab-4b4492cc-bucket-dags/data-dag.py]
module.data-pipelines.google_storage_bucket_object.dbt-dag-code["dbt-dag.py"]: Refreshing state... [id=europe-west1-demo-lab-4b4492cc-bucket-dags/dbt-dag.py]
data.google_container_cluster.composer-gke-cluster: Reading...
module.dbt_docker_image.docker_image.dbt: Refreshing state... [id=sha256:666ccf95ebaa3cc88f0d49de032b8ea990f051fb222e7eb05a9b58f194598a47eu.gcr.io/tbd-2024l-276747/dbt:1.7.13]
module.dbt_docker_image.docker_registry_image.dbt: Refreshing state... [id=sha256:cd5615e41fd7cac515f93e95f6c0b32623ca3e94c0f532a5862788c16f1677c3]
module.vertex_ai_workbench.google_notebooks_instance.tbd_notebook: Refreshing state... [id=projects/tbd-2024l-276747/locations/europe-west1-b/instances/tbd-2024l-276747-notebook]
data.google_container_cluster.composer-gke-cluster: Read complete after 4s [id=projects/tbd-2024l-276747/locations/europe-west1/clusters/europe-west1-demo-lab-4b4492cc-gke]
kubernetes_service.dbt-task-service: Refreshing state... [id=composer-user-workloads/dbt-task-service]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.dbt_docker_image.docker_image.dbt has been deleted
  - resource "docker_image" "dbt" {
        id          = "sha256:666ccf95ebaa3cc88f0d49de032b8ea990f051fb222e7eb05a9b58f194598a47eu.gcr.io/tbd-2024l-276747/dbt:1.7.13"
      - name        = "eu.gcr.io/tbd-2024l-276747/dbt:1.7.13" -> null
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.jupyter_docker_image.docker_image.jupyter has been deleted
  - resource "docker_image" "jupyter" {
        id          = "sha256:6c13f563ad95714100ead4872a8d53d83e8c784991d89f35bc1a2caa5d57dbeceu.gcr.io/tbd-2024l-276747/jupyter:3.6.3"
      - name        = "eu.gcr.io/tbd-2024l-276747/jupyter:3.6.3" -> null
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.composer.module.composer.google_composer_environment.composer_env has changed
  ~ resource "google_composer_environment" "composer_env" {
        id               = "projects/tbd-2024l-276747/locations/europe-west1/environments/demo-lab"
      + labels           = {}
        name             = "demo-lab"
        # (4 unchanged attributes hidden)

      ~ config {
            # (8 unchanged attributes hidden)

          ~ node_config {
              + tags                              = []
                # (12 unchanged attributes hidden)
            }

          ~ software_config {
              + airflow_config_overrides = {}
              + pypi_packages            = {}
                # (5 unchanged attributes hidden)

                # (1 unchanged block hidden)
            }

            # (7 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # kubernetes_service.dbt-task-service will be updated in-place
  ~ resource "kubernetes_service" "dbt-task-service" {
        id                     = "composer-user-workloads/dbt-task-service"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              - "cloud.google.com/neg" = jsonencode(
                    {
                      - ingress = true
                    }
                ) -> null
            }
            name             = "dbt-task-service"
            # (6 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.dbt_docker_image.docker_image.dbt will be created
  + resource "docker_image" "dbt" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "eu.gcr.io/tbd-2024l-276747/dbt:1.7.13"
      + repo_digest = (known after apply)
      + triggers    = {
          + "dir_sha1" = "16d9a47a192d8b357f5d8b2ba5b77c3a61503388"
        }

      + build {
          + build_args     = {
              + "DBT_SPARK_VERSION" = "1.7.1"
              + "DBT_VERSION"       = "1.7.13"
              + "PROJECT_NAME"      = "tbd-2024l-276747"
              + "SPARK_VERSION"     = "3.3.2"
            }
          + cache_from     = []
          + context        = "modules/dbt_docker_image/resources"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "amd64"
          + remove         = true
          + security_opt   = []
          + tag            = [
              + "eu.gcr.io/tbd-2024l-276747/dbt:latest",
            ]
            # (10 unchanged attributes hidden)
        }
    }

  # module.gcr.google_artifact_registry_repository.registry will be updated in-place
  ~ resource "google_artifact_registry_repository" "registry" {
        id                     = "projects/tbd-2024l-276747/locations/europe/repositories/eu.gcr.io"
        name                   = "eu.gcr.io"
        # (13 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

  # module.jupyter_docker_image.docker_image.jupyter will be created
  + resource "docker_image" "jupyter" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "eu.gcr.io/tbd-2024l-276747/jupyter:3.6.3"
      + repo_digest = (known after apply)
      + triggers    = {
          + "dir_sha1" = "0ae070775d3102ba9dae4391e78e62e46185e752"
        }

      + build {
          + build_args     = {
              + "DBT_SPARK_VERSION"     = "1.7.1"
              + "DBT_VERSION"           = "1.7.13"
              + "GCS_CONNECTOR_VERSION" = "2.2.17"
              + "JUPYTERLAB_VERSION"    = "3.6.3"
              + "PROJECT_NAME"          = "tbd-2024l-276747"
              + "SPARK_VERSION"         = "3.3.2"
            }
          + cache_from     = []
          + context        = "modules/jupyter_docker_image/resources"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "amd64"
          + remove         = true
          + security_opt   = []
          + tag            = [
              + "eu.gcr.io/tbd-2024l-276747/jupyter:latest",
            ]
            # (10 unchanged attributes hidden)
        }
    }

  # module.vertex_ai_workbench.data.google_project.project will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + deletion_policy     = (known after apply)
      + effective_labels    = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "tbd-2024l-276747"
      + skip_delete         = (known after apply)
      + terraform_labels    = (known after apply)
    }

  # module.vertex_ai_workbench.google_project_iam_binding.token_creator_role will be updated in-place
  ~ resource "google_project_iam_binding" "token_creator_role" {
        id      = "tbd-2024l-276747/roles/iam.serviceAccountTokenCreator"
      ~ members = [
          - "serviceAccount:704118541832-compute@developer.gserviceaccount.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.vertex_ai_workbench.google_storage_bucket_iam_binding.binding will be updated in-place
  ~ resource "google_storage_bucket_iam_binding" "binding" {
        id      = "b/tbd-2024l-276747-conf/roles/storage.objectViewer"
      ~ members = [
          - "serviceAccount:704118541832-compute@developer.gserviceaccount.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.composer.module.composer.google_composer_environment.composer_env will be updated in-place
  ~ resource "google_composer_environment" "composer_env" {
        id               = "projects/tbd-2024l-276747/locations/europe-west1/environments/demo-lab"
        name             = "demo-lab"
        # (5 unchanged attributes hidden)

      ~ config {
            # (8 unchanged attributes hidden)

          ~ software_config {
              ~ env_variables            = {
                  ~ "AIRFLOW_VAR_DBT_GIT_REPO"        = "https://github.com/mwiewior/tbd-tpc-di.git" -> "https://github.com/pmalesa/tbd-tpc-di.git"
                    # (6 unchanged elements hidden)
                }
                # (6 unchanged attributes hidden)

                # (1 unchanged block hidden)
            }

            # (8 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 5 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "iac_service_account" but a
value was found in file "env/project.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Deprecated Resource

  with module.vertex_ai_workbench.google_notebooks_instance.tbd_notebook,
  on modules/vertex-ai-workbench/main.tf line 49, in resource "google_notebooks_instance" "tbd_notebook":
  49: resource "google_notebooks_instance" "tbd_notebook" {

`google_notebook_instance` is deprecated and will be removed in a future
major release. Use `google_workbench_instance` instead.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @pmalesa, Action: `pull_request`, Working Directory: ``, Workflow: `Tech Tests`*